app/Http/Controllers/DownloadController.php

insert into `download_profiles` (`diplom`, `id_student`, `updated_at`, `created_at`) values ('fileName1569166112.png', 3, '2019-09-22 15:28:32', '2019-09-22 15:28:32')
---

        $download_profile->id_student = $currentUser->id;

        $download_profile->save();