app/Http/Controllers/Admink/OnecourseController.php

    public function getCourse($course,$form)
    {
        $form=='fulltime'?$form='очная':$form='заочная';
       $students=User::where('course',$course)->where('form',$form)->pluck('id');
       $profiles=UserProfile::whereIn('user_id',$students)->get();
    	return view('admink.onecourse')->with('profiles',$profiles);
---
select `id` from `users` where `course` = '2' and `form` = 'очная'
select * from `user_profiles` where `user_id` in (5)
select * from `user_profiles` where `user_id` in (6, 7, 8, 9)